## nycflights13 패키지에는 2013년 뉴욕의 항공 운항 정보를 담고 있는 flights 데이터가 들어있습니다. nycflights13 패키지의 flights 데이터를 이용해 문제를 해결하세요.


# Q1. dest는 도착하는 공항(목적지)이 어디인지 나타낸 변수입니다. 어떤 공항으로 출발한 항공편이 가장 많은지 알아보세요.









# Q2. dest 변수의 값은 코드(FAA airport code)로 되어있기 때문에 구체적으로 어떤 공항을 의미하는지 알기 어렵습니다. nycflights13 패키지의 airports 데이터는 공항 코드별 공항명을 담고 있습니다. Q1을 통해 알아낸 공항 코드가 어떤 공항을 의미하는지, airports 데이터를 이용해 알아보세요. dplyr 패키지 함수를 이용하세요.



## Q3. 어떤 항공사의 '점유율'이 높았는지 알아보려고 합니다. 항공사별 점유율을 내림차순으로 나타낸 표를 출력하세요(힌트 : 점유율 = 전체 빈도에서 해당 구성 요소의 빈도가 차지하는 비율).









# Q4. hour 변수는 항공편이 몇 시에 출발했는지, 출발 시각을 담고 있습니다. 오전(AM)과 오후(PM)의 항공편 출발 백분율을 나타낸 표를 출력하세요.








# Q5. 오후에 출발하는 항공편이 어떤 공항으로 많이 가는지 알아보려고 합니다. 오후 출발 항공편의 목적지별 빈도와 점유율을 나타낸 표를 출력하세요. 표에는 상위 10개 목적지만 출력되게 설정하세요.












